contract Err{

    event Err(uint _no);
    //0:权限错误
    //1:输入格式错误
    //2:调用其他合约返回失败
    //3:余额不足
    //4:

    //普通错误:

    //10000000:  合约修改权限不足
    //11000001:  重置Key 角色不存在
    //11000002:  批准重置账户 角色输入错误
    //11000003:  批准重置账户 KEY输入错误
    //11000004:  尝试批准一个已经批准或拒绝的操作
    //11000005:  尝试拒绝一个已经批准或拒绝的操作
    //11000006:  批准操作账户输入错误

    //资产管理合约错误,合约编号:003
    //60030001:  地址无创建资产权限
    //60030002:  无权限修改"可创建资产账户表"
    //60030003:  无权限重置KEYS

    //60031001:  创建资产有效期错误
    //60031002:  创建资产ID错误
    //60031003:  创建资产代号错误
    //60031004:  创建资产精度错误
    //60031005:  创建资产总量错误
    //60031006:  创建资产当前总量错误
    //60031007:  重置Key 角色不存在
    //60031008:  批准重置账户 角色输入错误
    //60031009:批准重置账户 KEY输入错误

    //60032001:  创建资产失败,地址是空

    //60033001:  尝试批准一个已经批准的状态

}